---
kind: type
id: T:Autodesk.Revit.UI.Selection.ISelectionFilter
source: html/d552f44b-221c-0ecd-d001-41a5099b2f9f.htm
---
# Autodesk.Revit.UI.Selection.ISelectionFilter

An interface that provides the ability to filter objects during a selection operation.

## Syntax (C#)
```csharp
public interface ISelectionFilter
```